emacs/config.org
#+TITLE:Paul's GNU Emacs Config
#+AUTHOR: Paul Lapey
#+DESCRIPTION: Paul's personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2
* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#adding-scripts-directory-to-path][Adding scripts directory to path]]
  - [[#sourcing-the-scripts][Sourcing the scripts]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#evil-packages][Evil Packages]]
  - [[#keybindings][Keybindings]]
- [[#gui][GUI]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
  - [[#fonts][FONTS]]
  - [[#theme][THEME]]
  - [[#splash-screen][Splash Screen]]
  - [[#highlight-todo][HIGHLIGHT TODO]]
  - [[#rainbow-mode][RAINBOW MODE]]
  - [[#modeline][MODELINE]]
  - [[#diminish][DIMINISH]]
  - [[#rainbow-delimiters][RAINBOW Delimiters]]
  - [[#dashboard][DASHBOARD]]
  - [[#disable-menubar-toolbars-and-scrollbars][Disable Menubar, Toolbars, and Scrollbars]]
- [[#misc][MISC]]
  - [[#misc-variables][Misc. Variables]]
  - [[#backup][BACKUP]]
  - [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#eshell][Eshell]]
  - [[#sudo-edit][SUDO EDIT]]
  - [[#minibuffer-escape][MINIBUFFER ESCAPE]]
  - [[#dired][DIRED]]
- [[#company][COMPANY]]
- [[#helm][HELM]]
- [[#fzf][FZF]]
- [[#flycheck][FLYCHECK]]
- [[#ivy-counsel][IVY (COUNSEL)]]
- [[#org-mode][ORG MODE]]
  - [[#nice-keybindings][Nice Keybindings]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#evil-org][Evil-org]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#org-tempo][Org-Tempo]]
- [[#projectile][PROJECTILE]]
- [[#which-key][WHICH-KEY]]
- [[#language-integration-lsp-treesitter][Language Integration LSP, Treesitter]]

* IMPORTANT PROGRAMS TO LOAD FIRST
** Adding scripts directory to path 
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/emacs/setup_scripts")
#+end_src
** Sourcing the scripts
#+begin_src emacs-lisp
;; Elpaca package manager!
(require 'elpaca-setup)
;; Move buffers around!
;; (require 'buffer-move)
#+end_src
** Load Evil Mode
#+begin_src emacs-lisp
(use-package undo-tree
  :init
  (global-undo-tree-mode)
  )
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-undo-system 'undo-tree)

  (evil-mode)
  )
(use-package evil-collection
  :after evil
  :config
  (setq evil-collection-mode-list '(dashhboard dired ibuffer))
  (evil-collection-init))
(use-package evil-tutor)
;;(with-eval-after-load 'evil-maps
;;(define-key evil-motion-state-map (kbd "SPC") nil)
;;(define-key evil-motion-state-map (kbd "RET") nil)
;;(define-key evil-motion-state-map (kbd "TAB") nil)
;;)


;;Turns off elpaca-use-package-mode current declaration
;;Note this will cause the declaration to be interpreted immediately (not deferred).
;;Useful for configuring built-in emacs features.
(use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

;; Don't install anything. Defer execution of BODY
;; (elpaca nil (message "deferred"))
#+end_src
** Evil Packages
Vim has lots of great packages. Many of them have good emacs counterparts/emulations.
#+begin_src emacs-lisp
(use-package evil-commentary
  :config
  (setq evil-commentary-mode t)
  )
#+end_src
** Keybindings 
*** Basic Keybindings 
