emacs/config.el
(add-to-list 'load-path "~/.config/emacs/setup_scripts")

;; Elpaca package manager!
(require 'elpaca-setup)
;; Move buffers around!
(require 'buffer-move)

(use-package undo-tree
  :init
  (global-undo-tree-mode)
  )
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-undo-system 'undo-tree)

  (evil-mode)
  )
(use-package evil-collection
  :after evil
  :config
  (setq evil-collection-mode-list '(dashhboard dired ibuffer))
  (evil-collection-init))
(use-package evil-tutor)
;;(with-eval-after-load 'evil-maps
;;(define-key evil-motion-state-map (kbd "SPC") nil)
;;(define-key evil-motion-state-map (kbd "RET") nil)
;;(define-key evil-motion-state-map (kbd "TAB") nil)
;;)


;;Turns off elpaca-use-package-mode current declaration
;;Note this will cause the declaration to be interpreted immediately (not deferred).
;;Useful for configuring built-in emacs features.
(use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

;; Don't install anything. Defer execution of BODY
;; (elpaca nil (message "deferred"))

(use-package evil-commentary
  :config
  (setq evil-commentary-mode t)
  )
