emacs/config.el

(use-package general
  :config
  (general-evil-setup)
  ;; set up 'SPC' as the global leader key
  (general-create-definer pwl/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode

  ;; Basic QOL maps
  (pwl/leader-keys
    "wq" '((lambda () (interactive) (save-buffer) (kill-emacs)) :wk "Write and quit")
    )

  ;; Buffer Navigation
  (pwl/leader-keys
    "SPC" '(counsel-M-x :wk "Counsel M-x")
    "." '(find-file :wk "Find file")
    "fc" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit emacs config")
    "fr" '(counsel-recentf :wk "Find recent files")
    "ff" '(helm-multi-files :wk "Fuzzy find files in helm")
    "fg" '(helm-rg :wk "rip grep for files with helm")
    "rg" '(helm-rg :wk "rip grep for files with helm")
    "TAB TAB" '(comment-line :wk "Comment lines")
    )

  ;; Buffer Navigation
  (pwl/leader-keys
    "b" '(:ignore t :wk "buffer")
    "bb" '(switch-to-buffer :wk "Switch buffer")
    "bi" '(ibuffer :wk "Ibuffer")
    "bk" '(kill-this-buffer :wk "Kill this buffer")
    "bn" '(next-buffer :wk "Next buffer")
    "bp" '(previous-buffer :wk "Previous buffer")
    "bl" '((lambda () (interactive) (switch-to-buffer (other-buffer (current-buffer) 1))) :wk "Last buffer")
    "br" '(revert-buffer :wk "Reload buffer")

    )

  ;; elisp evaluation
  (pwl/leader-keys
    "e" '(:ignore t :wk "Evaluate")
    "eb" '(eval-buffer :wk "Evaluate elisp in buffer")
    "ed" '(eval-defun :wk "Evaluate defun containing or after point")
    "ee" '(eval-defun :wk "Evaluate elisp expression")
    "el" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "er" '(eval-last-sexp :wk "Evaluate elisp in region"))

  ;; help
  (pwl/leader-keys
    "h" '(:ignore t :wk "Help")
    "hf" '(describe-function :wk "Describe function")
    "hv" '(describe-variable :wk "Describe variable")
    "hb" '(describe-bindings :wk "Describe bindings")
    ;;"hrr" '((lambda () (interactive) (load-file user-init-file)) :wk "Reload emacs config"))
    "hrr" '((lambda () (interactive) 
              (load-file user-init-file)
              (ignore (elpaca-process-queues)) )
            :wk "Reload emacs config"))

  ;; window movement
  (pwl/leader-keys
    "w" '(:ignore t :wk "Windows")
    ;; Window splits
    "w c" '(evil-window-delete :wk "Close window")
    "w n" '(evil-window-new :wk "New window")
    "w s" '(evil-window-split :wk "Horizontal split window")
    "w v" '(evil-window-vsplit :wk "Vertical split window")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window left")
    "w j" '(evil-window-down :wk "Window down")
    "w k" '(evil-window-up :wk "Window up")
    "w l" '(evil-window-right :wk "Window right")
    "w w" '(evil-window-next :wk "Goto next window")
    ;; Move Windows
    "w H" '(buf-move-left :wk "Buffer move left")
    "w J" '(buf-move-down :wk "Buffer move down")
    "w K" '(buf-move-up :wk "Buffer move up")
    "w L" '(buf-move-right :wk "Buffer move right"))

  (pwl/leader-keys
    "m" '(:ignore t :wk "Org")
    "m a" '(org-agenda :wk "Org agenda")
    "m e" '(org-export-dispatch :wk "Org export dispatch")
    "m i" '(org-toggle-item :wk "Org toggle item")
    "m t" '(org-todo :wk "Org todo")
    "m B" '(org-babel-tangle :wk "Org babel tangle")
    "m T" '(org-todo-list :wk "Org todo list"))

  (pwl/leader-keys
    "m b" '(:ignore t :wk "Tables")
    "m b -" '(org-table-insert-hline :wk "Insert hline in table"))

  (pwl/leader-keys
    "m d" '(:ignore t :wk "Date/deadline")
    "m d t" '(org-time-stamp :wk "Org time stamp"))

  (pwl/leader-keys
    "d" '(:ignore t :wk "Dired")
    "d d" '(dired :wk "Open dired")
    "d j" '(dired-jump :wk "Dired jump to current")
    "d p" '(peep-dired :wk "Peep-dired"))

  (defun save-and-escape ()
    "Save the buffer and escape from the current mode."
    (interactive)
    (save-buffer)
    (evil-normal-state))

  (general-define-key
   :states '(normal insert visual)
   "C-SPC" 'save-and-escape)

  ;; Simple remaps for normal mode
  (general-define-key
   :states 'normal
   "Q" 'evil-lookup
   "J" 'evil-forward-paragraph
   "K" 'evil-backward-paragraph
   "H" 'evil-first-non-blank
   "L" 'evil-end-of-line
   "j" 'evil-next-visual-line
   "k" 'evil-previous-visual-line

)

  ;; Simple remaps for visual mode
  (general-define-key
   :states 'visual
   "H" 'evil-first-non-blank
   "L" 'evil-end-of-line)

  ;; S - substitute command skeleton and move the cursor between the two slashes
  ;; this is annoyingly difficult, have to do minibuffer-with-setup-hook
  (general-define-key
   :states 'normal
   :keymaps 'override
   "S" (lambda ()
         (interactive)
         (minibuffer-with-setup-hook
             (lambda () (backward-char 2))
           (evil-ex "%s//g"))
         )
   )

  (general-define-key
   :states 'visual
   :keymaps 'override
   "S" (lambda ()
         (interactive)
         (minibuffer-with-setup-hook
             (lambda () (backward-char 2))
           (evil-ex "'<,'>s//g")
           )
         )
   )

  ;; nnoremap c "_c
  (defvar my/original-evil-change-command (lookup-key evil-normal-state-map "c"))
  (defun my/evil-change-to-blackhole ()
    (interactive)
    (let ((evil-this-register ?_))
      (call-interactively my/original-evil-change-command)))
  (general-define-key
   :states '(normal visual)
   "c" 'my/evil-change-to-blackhole)

  ;; nnoremap C "_C
  (defvar my/original-evil-change-to-end-of-line-command (lookup-key evil-normal-state-map "C"))
  (defun my/evil-change-to-end-of-line-to-blackhole ()
    (interactive)
    (let ((evil-this-register ?_))
      (call-interactively my/original-evil-change-to-end-of-line-command)))
  (general-define-key
   :states '(normal visual)
   "C" 'my/evil-change-to-end-of-line-to-blackhole)


  )

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
