emacs/config.org
* COMPANY 
#+begin_src emacs-lisp
(defun my/company-complete-or-newline ()
  "Complete the selection if a company suggestion is highlighted, otherwise insert a newline."
  (interactive)
  (if (and (company-manual-begin) company-selection-changed)
      (company-complete-selection)
    (newline)))

(use-package company
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .05)
  (company-minimum-prefix-length 1)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t)
  (company-tng-mode t)
  :config
  (define-key company-active-map (kbd "RET") #'my/company-complete-or-newline)
  (define-key company-active-map [return] #'my/company-complete-or-newline)
  (add-to-list 'company-backends 'company-dabbrev-code)
  (setq company-dabbrev-code-ignore-case t)
  (setq company-dabbrev-downcase nil)
  (setq company-dabbrev-code-everywhere t)
  (setq company-dabbrev-code-modes t)
  (setq company-dabbrev-code-other-buffers 'all)

  )


;; (with-eval-after-load 'company


(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))
#+end_src
* HELM
#+begin_src emacs-lisp
(use-package helm
  :ensure t  ; Make sure the package is installed automatically
  :init
  ;; You can set Helm-specific initialization settings here
  :config
  ;; (require 'helm-config)  ; Load Helm configuration

  ;; Set Helm as the default completion mechanism
  (helm-mode 1)
  (setq helm-mode-fuzzy-match t)
  (setq helm-completion-in-region-fuzzy-match t)

  ;; Bind the Helm command to a key combination, e.g., "C-x C-f" for `helm-find-files`
  ;; (global-set-key (kbd "C-x C-f") #'helm-find-files)
  ;; (global-set-key (kbd "M-x") #'helm-M-x)
  ;; (global-set-key (kbd "C-x b") #'helm-buffers-list)
  ;; ... and other key bindings as needed

  ;; You can customize Helm further using `setq` and other configuration commands
  )
(use-package helm-rg
  :ensure t  ; Automatically install the package if not already installed
  :config
  ;; Optional: put any configuration you want to execute after helm-rg is loaded
  )


#+end_src
* FZF
#+begin_src emacs-lisp
(use-package fzf
  :bind
  ;; Don't forget to set keybinds!
  :config
  (setq fzf/args "-x --color bw --print-query --margin=1,0 --no-hscroll"
        fzf/executable "fzf"
        fzf/git-grep-args "-i --line-number %s"
        ;; command used for `fzf-grep-*` functions
        ;; example usage for ripgrep:
        ;; fzf/grep-command "rg --no-heading -nH"
        fzf/grep-command "grep -nrH"
        ;; If nil, the fzf buffer will appear at the top of the window
        fzf/position-bottom t
        fzf/window-height 15))
#+end_src
* FLYCHECK
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t
  :defer t
  :diminish
  :init (global-flycheck-mode))
#+end_src
* IVY (COUNSEL)
+ Ivy, a generic completion mechanism for Emacs.
+ Counsel, a collection of Ivy-enhanced versions of common Emacs commands
+ Ivy-rich allows us to add descriptions alongside the commands in m-x
#+begin_src emacs-lisp
(use-package ivy
  :bind
  ;; ivy-resume resumes the last Ivy-based completion.
  (("C-c C-r" . ivy-resume)
   ("C-x B" . ivy-switch-buffer-other-window))
  :custom
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)
  :diminish
  :config
  (ivy-mode))

(use-package counsel
  :after ivy
  :diminish
  :config (counsel-mode))

(use-package ivy-rich
  :after ivy
  :ensure t
  :init (ivy-rich-mode 1) ;; this gets us descriptions in M-x.
  :custom
  (ivy-virtual-abbreviate 'full
                          ivy-rich-switch-buffer-align-virtual-buffer t
                          ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))

(use-package all-the-icons-ivy-rich
  :ensure t
  :diminish
  :init (all-the-icons-ivy-rich-mode 1))

#+end_src
* ORG MODE
** Nice Keybindings
#+begin_src emacs-lisp
(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src
** Enabling Table of Contents
#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Enabling Org Bullets
Org-bullets gives us attractive bullets rather than asterisks.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src


** Evil-org
Org mode 
#+begin_src emacs-lisp
(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src>
** Disable Electric Indent
Electric indent behaves weirdly in org mode. Let's turn it off for org-mode but on otherwise.
#+begin_src emacs-lisp
;; ;; Enable electric indent globally
(electric-indent-mode 1)

;; Disable electric indent in org-mode by adding a hook
(add-hook 'org-mode-hook (lambda () (electric-indent-local-mode -1)))
(setq org-edit-src-content-indentation 0)

#+end_src

** Org-Tempo
insert mode keychords for creating blocks. <s followed by TAB creates a source code block, for example
#+begin_src emacs-lisp
(require 'org-tempo)
#+end_src

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |
* PROJECTILE
#+begin_src emacs-lisp
(use-package projectile
  ;;:diminish
  :init
  (projectile-mode +1)
  :config
  (setq projectile-project-search-path '("~"))
  )

#+end_src
* WHICH-KEY
#+begin_src emacs-lisp
(use-package which-key
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit nil
        which-key-separator " → " ))
#+end_src
* Language Integration LSP, Treesitter 
#+begin_src emacs-lisp
;; This is required for nix-mode, for some reason. 
;; (use-package seq
;;   :ensure t
;;   ;; :defer t
;;   :pin melpa-stable
;;   :ensure-system-package (seq . "version-2.24"))

(use-package nix-mode
  :mode "\\.nix\\'")

(use-package rust-mode
  :ensure t)


(use-package terraform-mode
  :ensure t
  :mode (("\\.tf\\'" . terraform-mode)
         ("\\.tf\\.erb\\'" . terraform-mode)))
;;(use-package ruby-mode)
(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :hook ((python-mode . lsp-deferred)  ;; LSP start automatically for Python
         (rust-mode . lsp-deferred)    ;; And for Rust
         (cc-mode . lsp-deferred)    ;; And for C/C++
         (js-mode . lsp-deferred)        ;; And for JavaScript
         (terraform-mode . lsp-deferred) ;; And for Terraform
         (ruby-mode . lsp-deferred) ;; And for ruby
         ;; Add other major modes that you want LSP to support
         )
  :config
  (setq lsp-enable-symbol-highlighting t)
  (setq lsp-signature-auto-activate nil)
  (setq lsp-auto-guess-root t)
  (setq +format-with-lsp nil)
  (setq lsp-enable-indentation nil)
  (setq lsp-enable-on-type-formatting nil)
  )
;; You can adjust LSP settings here

(use-package tree-sitter
  :ensure t
  :config
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

;; bad idea
(setq warning-minimum-level :error)
#+end_src
